#### `terraform plan` Success
<details><summary>Show Output</summary>

```
FE/v202003-1
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] AzureRM Client User Agent: Go/go1.12.6 (amd64-linux) go-autorest/v14.0.0 Azure-SDK-For-Go/v40.3.0 backup/2019-05-13 HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1 terraform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] Using modified User-Agent: HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] AzureRM Client User Agent: Go/go1.12.6 (amd64-linux) go-autorest/v14.0.0 Azure-SDK-For-Go/v40.3.0 backup/2019-05-13 HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1 terraform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] Using modified User-Agent: HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] AzureRM Client User Agent: Go/go1.12.6 (amd64-linux) go-autorest/v14.0.0 Azure-SDK-For-Go/v40.3.0 redis/2018-03-01 HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1 terraform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] Using modified User-Agent: HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] AzureRM Client User Agent: Go/go1.12.6 (amd64-linux) go-autorest/v14.0.0 Azure-SDK-For-Go/v40.3.0 redis/2018-03-01 HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1 terraform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] Using modified User-Agent: HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1
raform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] Using modified User-Agent: HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] AzureRM Client User Agent: Go/go1.12.6 (amd64-linux) go-autorest/v14.0.0 Azure-SDK-For-Go/v40.3.0 relay/2017-04-01 HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1 terraform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] Using modified User-Agent: HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] AzureRM Client User Agent: Go/go1.12.6 (amd64-linux) go-autorest/v14.0.0 Azure-SDK-For-Go/v40.3.0 relay/2017-04-01 HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1 terraform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] Using modified User-Agent: HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] AzureRM Client User Agent: Go/go1.12.6 (amd64-linux) go-autorest/v14.0.0 Azure-SDK-For-Go/v40.3.0 resources/2018-05-01 HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1 terraform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] Using modified User-Agent: HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1
19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] AzureRM Client User Agent: Go/go1.12.6 (amd64-linux) go-autorest/v14.0.0 Azure-SDK-For-Go/v40.3.0 resources/2018-05-01 HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1 terraform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] Using modified User-Agent: HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] AzureRM Client User Agent: Go/go1.12.6 (amd64-linux) go-autorest/v14.0.0 Azure-SDK-For-Go/v40.3.0 locks/2016-09-01 HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1 terraform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] Using modified User-Agent: HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] AzureRM Client User Agent: Go/go1.12.6 (amd64-linux) go-autorest/v14.0.0 Azure-SDK-For-Go/v40.3.0 resources/2016-02-01 HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1 terraform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] Using modified User-Agent: HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1
-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] Using modified User-Agent: HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] AzureRM Client User Agent: Go/go1.12.6 (amd64-linux) go-autorest/v14.0.0 Azure-SDK-For-Go/v40.3.0 search/2015-08-19 HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1 terraform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] Using modified User-Agent: HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] AzureRM Client User Agent: Go/go1.12.6 (amd64-linux) go-autorest/v14.0.0 Azure-SDK-For-Go/v40.3.0 search/2015-08-19 HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1 terraform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] Using modified User-Agent: HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] AzureRM Client User Agent: Go/go1.12.6 (amd64-linux) go-autorest/v14.0.0 Azure-SDK-For-Go/v40.3.0 search/2015-08-19 HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1 terraform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] Using modified User-Agent: HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1
 [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] AzureRM Client User Agent: Go/go1.12.6 (amd64-linux) go-autorest/v14.0.0 Azure-SDK-For-Go/v40.3.0 security/v1.0 HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1 terraform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] Using modified User-Agent: HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] AzureRM Client User Agent: Go/go1.12.6 (amd64-linux) go-autorest/v14.0.0 Azure-SDK-For-Go/v40.3.0 security/v1.0 HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1 terraform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] Using modified User-Agent: HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] AzureRM Client User Agent: Go/go1.12.6 (amd64-linux) go-autorest/v14.0.0 Azure-SDK-For-Go/v40.3.0 security/v1.0 HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1 terraform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] Using modified User-Agent: HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1
c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] Using modified User-Agent: HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] AzureRM Client User Agent: Go/go1.12.6 (amd64-linux) go-autorest/v14.0.0 Azure-SDK-For-Go/v40.3.0 servicebus/2017-04-01 HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1 terraform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] Using modified User-Agent: HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] AzureRM Client User Agent: Go/go1.12.6 (amd64-linux) go-autorest/v14.0.0 Azure-SDK-For-Go/v40.3.0 servicebus/2017-04-01 HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1 terraform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] Using modified User-Agent: HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] AzureRM Client User Agent: Go/go1.12.6 (amd64-linux) go-autorest/v14.0.0 Azure-SDK-For-Go/v40.3.0 servicebus/2018-01-01-preview HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1 terraform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] Using modified User-Agent: HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1
ugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] AzureRM Client User Agent: Go/go1.12.6 (amd64-linux) go-autorest/v14.0.0 Azure-SDK-For-Go/v40.3.0 servicebus/2017-04-01 HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1 terraform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] Using modified User-Agent: HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] AzureRM Client User Agent: Go/go1.12.6 (amd64-linux) go-autorest/v14.0.0 Azure-SDK-For-Go/v40.3.0 servicebus/2017-04-01 HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1 terraform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] Using modified User-Agent: HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] AzureRM Client User Agent: Go/go1.12.6 (amd64-linux) go-autorest/v14.0.0 Azure-SDK-For-Go/v40.3.0 servicebus/2017-04-01 HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1 terraform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] Using modified User-Agent: HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1
er-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] Using modified User-Agent: HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] AzureRM Client User Agent: Go/go1.12.6 (amd64-linux) go-autorest/v14.0.0 Azure-SDK-For-Go/v40.3.0 signalr/2018-10-01 HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1 terraform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] Using modified User-Agent: HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] AzureRM Client User Agent: Go/go1.12.6 (amd64-linux) go-autorest/v14.0.0 Azure-SDK-For-Go/v40.3.0 sql/2017-03-01-preview HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1 terraform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] Using modified User-Agent: HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] AzureRM Client User Agent: Go/go1.12.6 (amd64-linux) go-autorest/v14.0.0 Azure-SDK-For-Go/v40.3.0 sql/2017-03-01-preview HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1 terraform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] Using modified User-Agent: HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1
567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] AzureRM Client User Agent: Go/go1.12.6 (amd64-linux) go-autorest/v14.0.0 Azure-SDK-For-Go/v40.3.0 sql/2017-03-01-preview HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1 terraform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] Using modified User-Agent: HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] AzureRM Client User Agent: Go/go1.12.6 (amd64-linux) go-autorest/v14.0.0 Azure-SDK-For-Go/v40.3.0 sql/2017-03-01-preview HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1 terraform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] Using modified User-Agent: HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] AzureRM Client User Agent: Go/go1.12.6 (amd64-linux) go-autorest/v14.0.0 Azure-SDK-For-Go/v40.3.0 sql/2017-03-01-preview HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1 terraform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] Using modified User-Agent: HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1
terraform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] Using modified User-Agent: HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] AzureRM Client User Agent: Go/go1.12.6 (amd64-linux) go-autorest/v14.0.0 Azure-SDK-For-Go/v40.3.0 sql/2017-03-01-preview HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1 terraform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] Using modified User-Agent: HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] AzureRM Client User Agent: Go/go1.12.6 (amd64-linux) go-autorest/v14.0.0 Azure-SDK-For-Go/v40.3.0 sql/2017-03-01-preview HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1 terraform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] Using modified User-Agent: HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] AzureRM Client User Agent: Go/go1.12.6 (amd64-linux) go-autorest/v14.0.0 Azure-SDK-For-Go/v40.3.0 sql/2017-03-01-preview HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1 terraform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] Using modified User-Agent: HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] AzureRM Client User Agent: Go/go1.12.6 (amd64-linux) go-autorest/v14.0.0 Azure-SDK-For-Go/v40.3.0 sql/2017-03-01-preview HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1 terraform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] Using modified User-Agent: HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] AzureRM Client User Agent: Go/go1.12.6 (amd64-linux) go-autorest/v14.0.0 Azure-SDK-For-Go/v40.3.0 storage/2019-04-01 HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1 terraform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] Using modified User-Agent: HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] AzureRM Client User Agent: Go/go1.12.6 (amd64-linux) go-autorest/v14.0.0 tombuildsstuff/giovanni/v0.10.0 storage/2018-11-09 HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1 terraform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] Using modified User-Agent: HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1
 TFE/v202003-1 terraform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] Using modified User-Agent: HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] AzureRM Client User Agent: Go/go1.12.6 (amd64-linux) go-autorest/v14.0.0 Azure-SDK-For-Go/v40.3.0 storage/2019-04-01 HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1 terraform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] Using modified User-Agent: HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] AzureRM Client User Agent: Go/go1.12.6 (amd64-linux) go-autorest/v14.0.0 Azure-SDK-For-Go/v40.3.0 storagecache/2019-11-01 HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1 terraform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] Using modified User-Agent: HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] AzureRM Client User Agent: Go/go1.12.6 (amd64-linux) go-autorest/v14.0.0 Azure-SDK-For-Go/v40.3.0 storagecache/2019-11-01 HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1 terraform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
FE/v202003-1
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] AzureRM Client User Agent: Go/go1.12.6 (amd64-linux) go-autorest/v14.0.0 Azure-SDK-For-Go/v40.3.0 streamanalytics/2016-03-01 HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1 terraform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] Using modified User-Agent: HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] AzureRM Client User Agent: Go/go1.12.6 (amd64-linux) go-autorest/v14.0.0 Azure-SDK-For-Go/v40.3.0 streamanalytics/2016-03-01 HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1 terraform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] Using modified User-Agent: HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] AzureRM Client User Agent: Go/go1.12.6 (amd64-linux) go-autorest/v14.0.0 Azure-SDK-For-Go/v40.3.0 streamanalytics/2016-03-01 HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1 terraform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] Using modified User-Agent: HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1
orm.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1 terraform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] Using modified User-Agent: HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] AzureRM Client User Agent: Go/go1.12.6 (amd64-linux) go-autorest/v14.0.0 Azure-SDK-For-Go/v40.3.0 streamanalytics/2016-03-01 HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1 terraform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] Using modified User-Agent: HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] AzureRM Client User Agent: Go/go1.12.6 (amd64-linux) go-autorest/v14.0.0 Azure-SDK-For-Go/v40.3.0 subscriptions/2018-06-01 HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1 terraform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] Using modified User-Agent: HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] AzureRM Client User Agent: Go/go1.12.6 (amd64-linux) go-autorest/v14.0.0 Azure-SDK-For-Go/v40.3.0 trafficmanager/2018-04-01 HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1 terraform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
ww.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] AzureRM Client User Agent: Go/go1.12.6 (amd64-linux) go-autorest/v14.0.0 Azure-SDK-For-Go/v40.3.0 trafficmanager/2018-04-01 HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1 terraform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] Using modified User-Agent: HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] AzureRM Client User Agent: Go/go1.12.6 (amd64-linux) go-autorest/v14.0.0 Azure-SDK-For-Go/v40.3.0 trafficmanager/2018-04-01 HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1 terraform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] Using modified User-Agent: HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] AzureRM Client User Agent: Go/go1.12.6 (amd64-linux) go-autorest/v14.0.0 Azure-SDK-For-Go/v40.3.0 web/2019-08-01 HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1 terraform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] Using modified User-Agent: HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1
+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1 terraform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] Using modified User-Agent: HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] AzureRM Client User Agent: Go/go1.12.6 (amd64-linux) go-autorest/v14.0.0 Azure-SDK-For-Go/v40.3.0 web/2019-08-01 HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1 terraform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] Using modified User-Agent: HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] AzureRM Client User Agent: Go/go1.12.6 (amd64-linux) go-autorest/v14.0.0 Azure-SDK-For-Go/v40.3.0 web/2019-08-01 HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1 terraform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] Using modified User-Agent: HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] AzureRM Client User Agent: Go/go1.12.6 (amd64-linux) go-autorest/v14.0.0 Azure-SDK-For-Go/v40.3.0 web/2019-08-01 HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1 terraform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
o) Terraform Plugin SDK/1.6.0 TFE/v202003-1
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] AzureRM Client User Agent: Go/go1.12.6 (amd64-linux) go-autorest/v14.0.0 Azure-SDK-For-Go/v40.3.0 web/2019-08-01 HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1 terraform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] AzureRM Request: 
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: POST /9be65afb-169d-45b7-bcc2-987e74362a97/oauth2/token?api-version=1.0 HTTP/1.1
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: Host: login.microsoftonline.com
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: User-Agent: Go/go1.12.6 (amd64-linux) go-autorest/adal/v1.0.0
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: Content-Length: 174
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: Content-Type: application/x-www-form-urlencoded
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: Accept-Encoding: gzip
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: 
2020-04-28T20:08:19.567Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: client_id=c2301900-3f6d-486b-9a97-bf0197c216c4&client_secret=bef89ada-47f7-e7d3-c798-ec5dc97ddc3f&grant_type=client_credentials&resource=https%3A%2F%2Fmanagement.azure.com%2F
2020-04-28T20:08:19.709Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] AzureRM Response for https://login.microsoftonline.com/9be65afb-169d-45b7-bcc2-987e74362a97/oauth2/token?api-version=1.0: 
2020-04-28T20:08:19.710Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: HTTP/1.1 200 OK
2020-04-28T20:08:19.710Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: Content-Length: 1404
2020-04-28T20:08:19.710Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: Cache-Control: no-cache, no-store
2020-04-28T20:08:19.710Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: Content-Type: application/json; charset=utf-8
2020-04-28T20:08:19.710Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: Date: Tue, 28 Apr 2020 20:08:19 GMT
2020-04-28T20:08:19.710Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: Expires: -1
2020-04-28T20:08:19.710Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: P3p: CP="DSP CUR OTPi IND OTRi ONL FIN"
2020-04-28T20:08:19.710Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: Pragma: no-cache
2020-04-28T20:08:19.710Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: Set-Cookie: fpc=ApSMPEpnCp1FoVRNm9Dy7AbKjia_AQAAADOEOtYOAAAA; expires=Thu, 28-May-2020 20:08:19 GMT; path=/; secure; HttpOnly; SameSite=None
2020-04-28T20:08:19.710Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: Set-Cookie: x-ms-gateway-slice=prod; path=/; SameSite=None; secure; HttpOnly
2020-04-28T20:08:19.710Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: Set-Cookie: stsservicecookie=ests; path=/; SameSite=None; secure; HttpOnly
2020-04-28T20:08:19.710Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: Strict-Transport-Security: max-age=31536000; includeSubDomains
2020-04-28T20:08:19.710Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: X-Content-Type-Options: nosniff
2020-04-28T20:08:19.710Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: X-Ms-Ests-Server: 2.1.10433.14 - EST ProdSlices
2020-04-28T20:08:19.710Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: X-Ms-Request-Id: 4f7fe382-f4bd-456c-b7ce-08c5c4453900
2020-04-28T20:08:19.710Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: 
2020-04-28T20:08:19.710Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: {"token_type":"Bearer","expires_in":"3599","ext_expires_in":"3599","expires_on":"1588108099","not_before":"1588104199","resource":"https://management.azure.com/","access_token":"eyJ0eXAiOiJKV1QiLCJhbGciOiJSUzI1NiIsIng1dCI6IkN0VHVoTUptRDVNN0RMZHpEMnYyeDNRS1NSWSIsImtpZCI6IkN0VHVoTUptRDVNN0RMZHpEMnYyeDNRS1NSWSJ9.eyJhdWQiOiJodHRwczovL21hbmFnZW1lbnQuYXp1cmUuY29tLyIsImlzcyI6Imh0dHBzOi8vc3RzLndpbmRvd3MubmV0LzliZTY1YWZiLTE2OWQtNDViNy1iY2MyLTk4N2U3NDM2MmE5Ny8iLCJpYXQiOjE1ODgxMDQxOTksIm5iZiI6MTU4ODEwNDE5OSwiZXhwIjoxNTg4MTA4MDk5LCJhaW8iOiI0MmRnWURocDRQbDVFY2NiN21lMWkrV2padTdnQUFBPSIsImFwcGlkIjoiYzIzMDE5MDAtM2Y2ZC00ODZiLTlhOTctYmYwMTk3YzIxNmM0IiwiYXBwaWRhY3IiOiIxIiwiZ3JvdXBzIjpbIjJmMDE2NDFjLTkwNmYtNDk4Ny04MTU0LTJlMjhlODUyOWM5NSJdLCJpZHAiOiJodHRwczovL3N0cy53aW5kb3dzLm5ldC85YmU2NWFmYi0xNjlkLTQ1YjctYmNjMi05ODdlNzQzNjJhOTcvIiwib2lkIjoiMmMxYzkzOGEtNTdkYi00MjU5LTk0MjktOTBiMzZlNWYwZGQ5Iiwic3ViIjoiMmMxYzkzOGEtNTdkYi00MjU5LTk0MjktOTBiMzZlNWYwZGQ5IiwidGlkIjoiOWJlNjVhZmItMTY5ZC00NWI3LWJjYzItOTg3ZTc0MzYyYTk3IiwidXRpIjoiZ3VOX1Q3MzBiRVczemdqRnhFVTVBQSIsInZlciI6IjEuMCJ9.lzYgxX8GVZKOYut8-9EaCnS5VzLcb8zCGYBrS-LQx6xLOBlRuq-CFvOtPl9wt17DuSYVIZC5n0hOpnkP2B53dtMZWbl64_mgqypNz4tn91f8BL2QC96YW49GOzetwjBEtItOMc4AK9zeBNLzHi8zp9-FUAHt6fMMFMqUuRxvyzE10FHKbck9Y7m5NuGbDiyoY30jBTPPGkL3pxsZSvQu8p1VYq0WxDLMqXqEhmZt5a1ayL5XKtgGM55IoGLmFUc3z1duptcv9WwNDPe-440vWIVa-XDbFgKWOlDlYeFi-zaUDGlWnsiVMs1F22onDGBuVoBzYdb7TZUKcQ3xi0E6Nw"}
2020-04-28T20:08:19.710Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] AzureRM Request: 
2020-04-28T20:08:19.710Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: GET /subscriptions/99a1241a-f743-4202-a85f-dddf3f2448b6/providers?api-version=2016-02-01 HTTP/1.1
2020-04-28T20:08:19.710Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: Host: management.azure.com
2020-04-28T20:08:19.710Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: User-Agent: Go/go1.12.6 (amd64-linux) go-autorest/v14.0.0 Azure-SDK-For-Go/v40.3.0 resources/2016-02-01 HashiCorp Terraform/0.12.24 (+https://www.terraform.io) Terraform Plugin SDK/1.6.0 TFE/v202003-1 terraform-provider-azurerm/2.4.0 pid-222c6c49-1b0a-5959-a213-6608f9eb8820
2020-04-28T20:08:19.710Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: X-Ms-Correlation-Request-Id: c5d15362-781f-1d65-c4d1-fc744d8bfc6a
2020-04-28T20:08:19.710Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: Accept-Encoding: gzip
2020-04-28T20:08:19.710Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: 
2020-04-28T20:08:19.710Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: 
2020-04-28T20:08:22.019Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] AzureRM Response for https://management.azure.com/subscriptions/99a1241a-f743-4202-a85f-dddf3f2448b6/providers?api-version=2016-02-01: 
2020-04-28T20:08:22.019Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: HTTP/2.0 200 OK
2020-04-28T20:08:22.019Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: Cache-Control: no-cache
2020-04-28T20:08:22.019Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: Content-Type: application/json; charset=utf-8
2020-04-28T20:08:22.019Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: Date: Tue, 28 Apr 2020 20:08:21 GMT
2020-04-28T20:08:22.019Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: Expires: -1
2020-04-28T20:08:22.019Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: Pragma: no-cache
2020-04-28T20:08:22.019Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: Strict-Transport-Security: max-age=31536000; includeSubDomains
2020-04-28T20:08:22.019Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: Vary: Accept-Encoding
2020-04-28T20:08:22.019Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: X-Content-Type-Options: nosniff
2020-04-28T20:08:22.019Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: X-Ms-Correlation-Request-Id: c5d15362-781f-1d65-c4d1-fc744d8bfc6a
2020-04-28T20:08:22.019Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: X-Ms-Ratelimit-Remaining-Subscription-Reads: 11999
2020-04-28T20:08:22.019Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: X-Ms-Request-Id: 4fe03190-a37c-4fea-bd76-3a2b003d7cf3
2020-04-28T20:08:22.019Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: X-Ms-Routing-Request-Id: EASTUS2:20200428T200821Z:4fe03190-a37c-4fea-bd76-3a2b003d7cf3
2020-04-28T20:08:22.019Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: 
,"2015-08-19","2015-02-28"]}],"registrationState":"Registered"},{"id":"/subscriptions/99a1241a-f743-4202-a85f-dddf3f2448b6/providers/Microsoft.Relay","namespace":"Microsoft.Relay","authorizations":[{"applicationId":"91bb937c-29c2-4275-982f-9465f0caf03d","roleDefinitionId":"6ea9e989-a5f4-4187-8d11-c8db3dd04da1"},{"applica
nResourceMove"},{"resourceType":"clusters/applications","locations":["West US","West US 2","West Central US","East US","East US 2","Central US","West Europe","North Europe","UK West","UK South","Australia East","Australia Southeast","North Central US","East Asia","Southeast Asia","Japan West","Japan East","South India","West India","Central India","Brazil South","South Central US","Korea Central","
-17-preview","2018-06-15-preview","2018-06-01-preview","2016-06-15-preview"],"capabilities":"SupportsExtension"},{"resourceType":"logs","locations":["East US","East US 2","West US","Central US","North Central US","South Central US","North Europe","West Europe","East Asia","Southeast Asia","Japan East","Japan West","Australia East","Australia Southeast","Brazil South","South India","Central India","West India","Canada Central","Canada East","West US 2","West Central US","UK So
h India","Switzerland North"],"apiVersions":["2019-12-01-preview","2019-05-01","2017-10-01"]},{"resourceType":"locations/setupAuth","locations":["East US","West Europe","West US 2","South Central US","Australia East","Australia Southeast","Brazil South","Canada Central","Canada East","Central India","Central US","East Asia","East US 2","Japan East","Japan West","North Central US","North Europe","Southeast Asia","South India","UK South","UK West","West US","West Central US","France Central","Korea Central","South Africa North","UAE North","Switzerland No
stanceEncryptionProtectorOperationResults","locations":["Australia Central","Australia East","Australia Southeast","Brazil South","Canada Central","Canada East","Central India","Central US","East Asia","East US","East US 2","France Central","Germany West Central","Japan East","Japan West","Korea Central","Korea South","North Central US","North Europe","Norway East","South Africa North","South Central US","South India","Southeast Asia","Switzerland North","UAE North","UK South","UK West","West Central US","West Europe","West India","West US","West US 2"],"apiVersions":["2019-06-01-preview","2018-06-01-preview","2017-10-01-preview"]
al","Korea South","North Central US","North Europe","Norway East","South Africa North","South Central US","South India","Southeast Asia","Switzerland North","UAE North","UK South","UK West","West Central US","West Europe","West India","West US","West US 2"],"apiVersions":["2019-06-01-preview","2018-06-01-preview","2017-10-01-preview","2017-03-01-preview","2015-05-01-preview"]},{"resourceType":"servers/syncAgents","locations":["Australia Central","Australia East","Australia Southeast","Brazil South","Canada Central","Canada East","Central India","Central US","East Asia","East US","East US 2","France Central","Germany West Central","Japan East","Japan West","Korea Central","Korea South","North Central US","Nor
6-07-01","2016-06-01","2016-03-30","2015-06-15","2015-05-01-preview","2014-12-01-preview"]},{"resourceType":"locations/operations","locations":[],"apiVersions":["2020-04-01","2020-03-01","2020-01-01","2019-12-01","2019-11-01","2019-09-01","2019-08-01","2019-07-01","2019-06-01","2019-04-01","2019-02-01","2018-12-01","2018-11-01","2018-10-01","2018-08-01","2018-07-01","2018-06-01","2018-05-01","2018-04-01","2018-03-01","2018-02-01","2018-01-01","2017-11-01","2017-10-01","2017-09-01","2017-08-01","2017-06-01","2017-04-01","2017-03-01","2016-12-01","2016-11-01","2016-10-01","2016-09-01","2016-08-01","2016-07-01","2016-06-01","2016-03-30","2015-06-15","2015-05-01-preview","2014-12-01-preview"]},{"resourceType":"locations/operationResults","locations":[],"apiVersions":["2020-04-01","2020-03-
Brazil South","Canada Central","Canada East","Central India","Central US","East Asia","East US 2","East US","France Central","Germany West Central","Japan East","Japan West","Korea Central","Korea South","North Central US","North Europe","South Africa North","South Africa West","South Central US","South India","Southeast Asia","Norway East","Switzerland North","UAE North","UK South","UK West","West Central US","West Europe","West India","West US","West US 2"],"apiVersions":["2018-06-01-preview","2018-06-01"],"capabilities":"CrossResourceGroupResourceMove, CrossSubscriptionResourceMove, SystemAssignedResourceIdentity"},{"resourceType":"servers/recoverableServers","locations":["Australia Central","Australia Central 2","Australia East","Australia Southeast","Brazil South","Canada Central","Canada East","Central US","Central India","East Asia","East US 2","East US","
06-01-beta","2018-06-01","2017-11-01-beta","2017-11-01"]},{"resourceType":"reservationOrders/merge","locations":[],"apiVersions":["2019-04-01-beta","2019-04-01","2018-06-01-beta","2018-06-01","2017-11-01-beta","2017-11-01"]},{"resourceType":"reservationOrders/swap","locations":[],"apiVersions":["2019-04-01-beta","2019-04-01","2018-06-01-beta","2018-06-01"]},{"resourceType":"validateReservationOrder","locations":[],"apiVersions":["2019-04-01-beta","2019-04-01","2018-06-01-beta","2018-06-01","2017-11-01-beta","2017-11-01"]},{"resourceType":"reservationOrders/availableScopes","locations":[],"apiVersions":["2019-04-01-beta","2019-04-01","2018-06-01-beta","2018-06-01","2017-11-01-beta","2017-11-01"]},{"resourceType":"reservationOrders/reservations/availableScopes","locations":[],"apiVersions":["2019-04-01-beta","2019-04-01"]},{"resourceType":"commercialReservationOrders","locations":[],"apiVersions":["2019-04-01-beta","2019-04-01","2018-06-01-be
ionResourceMove"},{"resourceType":"locations/operations","locations":["West Central US","Japan East","West US","Australia Southeast","Canada Central","Central India","Central US","East Asia","Korea Central","North Europe","South Central US","UK West","West India","Australia East","Brazil South","Canada East","East US","East US 2","Japan West","Korea South","North Central US","South India","Southeast Asia","UK South","West Europe","West US 2"],"apiVersions":["2019-01-01-preview","2018-10-15","2017-12-01-preview"]},{"resourceType":"operations","locations":[],"apiVersions":["2019-01-01-preview","2018-10-15","2017-12-01-preview"]},{"resourceType":"users","locations":[],"apiVersions":["2019-01-01-preview","2019-01-01-beta","2019-01-01-alpha","2018-10-15","2017-12-01-preview","2017-12-01-beta","2017-12-01-alpha"]},{"resourceType":"locations","locations":[],"apiVersions":["2019-01-01-preview","2018-10-15","2017-12-01-preview"]}],"registrationState":"NotRegistered"},{"id":"/subscriptions/99a1241a-f743-4202-a85f-dddf3f2448b6/p
06-05-preview"]},{"resourceType":"locations","locations":[],"apiVersions":["2019-06-01","2019-03-01","2019-02-01","2018-10-01","2018-07-01","2018-04-02"]},{"resourceType":"locations/checkNameAvailability","locations":["West US","West Europe","North Europe","Southeast Asia","East Asia","Australia East","Australia Southeast","East US","Canada Central","Canada East","Central US","East US 2","UK South","UK West","Central India","South India","North Central US","South Central US","Brazil South","Japan East","Japan West","West Central US","West US 2","Korea Central","Korea South","France Central","France South","South Africa North","South Africa West","UAE North","UAE Central"],"apiVersions":["2019-06-01","2019-03-01","2019-02-01","2018-10-01","2018-07-01","2018-04-02"]},{"resourceType":"locations/workflows","locations":["West US","West Europe","North Europe","Southeast Asia","East Asia","Australia East","Australia Southeast","East US","Canada Central","Canada East","Central US","East US 2","UK South","UK West","Central India","South India","West Central US","West US 2","North Central US","South Centr
ions":[],"apiVersions":["2015-01-01"]},{"resourceType":"updateCommunicationPreference","locations":[],"apiVersions":["2015-01-01"]}],"registrationState":"NotRegistered"},{"id":"/subscriptions/99a1241a-f743-4202-a85f-dddf3f2448b6/providers/Sparkpost.Basic","namespace":"Sparkpost.Basic","resourceTypes":[{"resourceType":"services","locations":["West US"],"apiVersions":["2016-08-01"],"capabilities":"None"},{"resourceType":"operations","locations":[],"apiVersions":["2016-08-01"]},{"resourceType":"listCommunicationPreference","locations":[],"apiVersions":["2016-08-01"]},{"resourceType":"updateCommunicationPreference","locations":[],"apiVersions":["2016-08-01"]}],"registrationState":"NotRegistered"},{"id":"/subscriptions/99a1241a-f743-4202-a85f-dddf3f2448b6/providers/stackify.retrace","namespace":"stackify.retrace","resourceTypes":[{"resourceType":"services","locations":["West US"],"apiVersions":["2016-01-01"],"capabilities":"None"},{"resourceType":"operations","locations":[],"apiVersions":["2016-01-01"]},{"resourceType":"listCommunicationPreference","locations":[],"apiVersions":["2016-01-01"]},{"resourceType":"updateCommunicationPreference","locations":[],"apiVersions":["2016-01-01"]}],"registrationState":"NotRegistered"},{"id":"/subscriptions/99a1241a-f743-4202-a85f-dddf3f2448b6/providers/U2uconsult.TheIdentityHub","namespace":"U2uconsult.TheIdentityHub","resourceTypes":[{"resourceType":"services","locations":["West Europe"],"apiVersions":["2015-06-15"],"capabilities":"None"},{"resourceType":"operations","locations":[],"apiVersions":["2015-06-15"]},{"resourceType":"listCommunicationPreference","locations":[],"apiVersions":["2015-06-15"]},{"resourceType":"updateCommunicationPreference","locations":[],"apiVersions":["2015-06-15"]}],"registrationState":"NotRegistered"}]}
2020-04-28T20:08:22.050Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] Determining which Resource Providers require Registration
2020-04-28T20:08:22.050Z [DEBUG] plugin.terraform-provider-azurerm_v2.4.0_x5: [DEBUG] All required Resource Providers are registered
2020/04/28 20:08:22 [DEBUG] Resource instance state not found for node "module.webapp.azurerm_resource_group.main", instance module.webapp.azurerm_resource_group.main
2020/04/28 20:08:22 [DEBUG] ReferenceTransformer: "module.webapp.azurerm_resource_group.main" references: []
2020/04/28 20:08:22 [DEBUG] Resource instance state not found for node "module.webapp.azurerm_app_service_plan.main", instance module.webapp.azurerm_app_service_plan.main
2020/04/28 20:08:22 [DEBUG] ReferenceTransformer: "module.webapp.azurerm_app_service_plan.main" references: []
2020/04/28 20:08:22 [WARN] Provider "registry.terraform.io/-/azurerm" produced an invalid plan for module.webapp.azurerm_app_service_plan.main, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .kind: planned value cty.StringVal("Windows") does not match config value cty.NullVal(cty.String)
2020/04/28 20:08:22 [DEBUG] Resource instance state not found for node "module.webapp.azurerm_app_service.main", instance module.webapp.azurerm_app_service.main
2020/04/28 20:08:22 [DEBUG] ReferenceTransformer: "module.webapp.azurerm_app_service.main" references: []
2020/04/28 20:08:22 [WARN] Provider "registry.terraform.io/-/azurerm" produced an invalid plan for module.webapp.azurerm_app_service.main, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .enabled: planned value cty.True does not match config value cty.NullVal(cty.Bool)
      - .https_only: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .storage_account: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .auth_settings: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .connection_string: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .logs: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .site_config[0].dotnet_framework_version: planned value cty.StringVal("v4.0") does not match config value cty.NullVal(cty.String)
      - .site_config[0].remote_debugging_enabled: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .site_config[0].scm_type: planned value cty.StringVal("None") does not match config value cty.NullVal(cty.String)
      - .site_config[0].always_on: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .site_config[0].http2_enabled: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .site_config[0].cors: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
2020/04/28 20:08:22 [DEBUG] Resource instance state not found for node "module.webapp.module.azureadgroup.azuread_group_member.addmember", instance module.webapp.module.azureadgroup.azuread_group_member.addmember
2020/04/28 20:08:22 [DEBUG] ReferenceTransformer: "module.webapp.module.azureadgroup.azuread_group_member.addmember" references: []
2020/04/28 20:08:22 [DEBUG] Resource instance state not found for node "module.webapp.module.setsecret.vault_generic_secret.app_details", instance module.webapp.module.setsecret.vault_generic_secret.app_details
2020-04-28T20:08:22.087Z [DEBUG] plugin: plugin process exited: path=/terraform/.terraform/plugins/linux_amd64/terraform-provider-azurerm_v2.4.0_x5 pid=252
2020-04-28T20:08:22.087Z [DEBUG] plugin: plugin exited
2020/04/28 20:08:22 [DEBUG] ReferenceTransformer: "module.webapp.module.setsecret.vault_generic_secret.app_details" references: []
2020-04-28T20:08:22.089Z [DEBUG] plugin.terraform-provider-vault_v2.10.0_x4: 2020/04/28 20:08:22 [ERROR] Invalid JSON data in vault_generic_secret: invalid character 'D' after top-level value
2020/04/28 20:08:22 [WARN] Provider "registry.terraform.io/-/vault" produced an invalid plan for module.webapp.module.setsecret.vault_generic_secret.app_details, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .disable_read: planned value cty.False does not match config value cty.NullVal(cty.Bool)
2020-04-28T20:08:22.091Z [DEBUG] plugin: plugin process exited: path=/terraform/.terraform/plugins/linux_amd64/terraform-provider-azuread_v0.7.0_x4 pid=260
2020-04-28T20:08:22.091Z [DEBUG] plugin: plugin exited
2020-04-28T20:08:22.097Z [DEBUG] plugin: plugin process exited: path=/terraform/.terraform/plugins/linux_amd64/terraform-provider-vault_v2.10.0_x4 pid=226
2020-04-28T20:08:22.097Z [DEBUG] plugin: plugin exited
2020/04/28 20:08:22 [INFO] backend/local: plan operation completed
2020/04/28 20:08:22 [INFO] backend/local: writing plan output to: /terraform/terraform.tfplan

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.webapp.azurerm_app_service.main will be created
  + resource "azurerm_app_service" "main" {
      + app_service_plan_id            = (known after apply)
      + app_settings                   = (known after apply)
      + client_affinity_enabled        = (known after apply)
      + default_site_hostname          = (known after apply)
      + enabled                        = true
      + https_only                     = false
      + id                             = (known after apply)
      + location                       = "eastus"
      + name                           = "webapp-java-eastus-dev-appservice"
      + outbound_ip_addresses          = (known after apply)
      + possible_outbound_ip_addresses = (known after apply)
      + resource_group_name            = "test-app-malcode-eastus-webapp-dev"
      + site_credential                = (known after apply)
      + source_control                 = (known after apply)
      + tags                           = {
          + "CostCentre"  = "1111"
          + "Environment" = "dev"
          + "Lob"         = "test"
          + "Owner"       = "Vineet Sharma"
          + "OwnerEmail"  = "vsharma@objectsharp.com"
          + "Project"     = "Rockhopper"
          + "malcode"     = "malcode"
        }

      + auth_settings {
          + additional_login_params        = (known after apply)
          + allowed_external_redirect_urls = (known after apply)
          + default_provider               = (known after apply)
          + enabled                        = (known after apply)
          + issuer                         = (known after apply)
          + runtime_version                = (known after apply)
          + token_refresh_extension_hours  = (known after apply)
          + token_store_enabled            = (known after apply)
          + unauthenticated_client_action  = (known after apply)

          + active_directory {
              + allowed_audiences = (known after apply)
              + client_id         = (known after apply)
              + client_secret     = (sensitive value)
            }

          + facebook {
              + app_id       = (known after apply)
              + app_secret   = (sensitive value)
              + oauth_scopes = (known after apply)
            }

          + google {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + microsoft {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + twitter {
              + consumer_key    = (known after apply)
              + consumer_secret = (sensitive value)
            }
        }

      + connection_string {
          + name  = (known after apply)
          + type  = (known after apply)
          + value = (sensitive value)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + logs {
          + application_logs {
              + azure_blob_storage {
                  + level             = (known after apply)
                  + retention_in_days = (known after apply)
                  + sas_url           = (sensitive value)
                }
            }

          + http_logs {
              + azure_blob_storage {
                  + retention_in_days = (known after apply)
                  + sas_url           = (sensitive value)
                }

              + file_system {
                  + retention_in_days = (known after apply)
                  + retention_in_mb   = (known after apply)
                }
            }
        }

      + site_config {
          + always_on                = false
          + dotnet_framework_version = "v4.0"
          + ftps_state               = (known after apply)
          + http2_enabled            = false
          + ip_restriction           = (known after apply)
          + java_container           = "TOMCAT"
          + java_container_version   = "8.5"
          + java_version             = "1.8"
          + linux_fx_version         = (known after apply)
          + local_mysql_enabled      = (known after apply)
          + managed_pipeline_mode    = (known after apply)
          + min_tls_version          = (known after apply)
          + remote_debugging_enabled = false
          + remote_debugging_version = (known after apply)
          + scm_type                 = "None"
          + websockets_enabled       = (known after apply)
          + windows_fx_version       = (known after apply)

          + cors {
              + allowed_origins     = (known after apply)
              + support_credentials = (known after apply)
            }
        }

      + storage_account {
          + access_key   = (sensitive value)
          + account_name = (known after apply)
          + mount_path   = (known after apply)
          + name         = (known after apply)
          + share_name   = (known after apply)
          + type         = (known after apply)
        }
    }

  # module.webapp.azurerm_app_service_plan.main will be created
  + resource "azurerm_app_service_plan" "main" {
      + id                           = (known after apply)
      + kind                         = "Windows"
      + location                     = "eastus"
      + maximum_elastic_worker_count = (known after apply)
      + maximum_number_of_workers    = (known after apply)
      + name                         = "webapp-java-eastus-dev-asp"
      + resource_group_name          = "test-app-malcode-eastus-webapp-dev"
      + tags                         = {
          + "CostCentre"  = "1111"
          + "Environment" = "dev"
          + "Lob"         = "test"
          + "Owner"       = "Vineet Sharma"
          + "OwnerEmail"  = "vsharma@objectsharp.com"
          + "Project"     = "Rockhopper"
          + "malcode"     = "malcode"
        }

      + sku {
          + capacity = (known after apply)
          + size     = "B1"
          + tier     = "Basic"
        }
    }

  # module.webapp.azurerm_resource_group.main will be created
  + resource "azurerm_resource_group" "main" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "test-app-malcode-eastus-webapp-dev"
    }

  # module.webapp.module.azureadgroup.azuread_group.adgroup will be created
  + resource "azuread_group" "adgroup" {
      + id        = (known after apply)
      + members   = (known after apply)
      + name      = "AZ_webApp_lob_java_webapp"
      + object_id = (known after apply)
      + owners    = (known after apply)
    }

  # module.webapp.module.azureadgroup.azuread_group_member.addmember will be created
  + resource "azuread_group_member" "addmember" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = (known after apply)
    }

  # module.webapp.module.setsecret.vault_generic_secret.app_details will be created
  + resource "vault_generic_secret" "app_details" {
      + data         = (sensitive value)
      + data_json    = (sensitive value)
      + disable_read = false
      + id           = (known after apply)
      + path         = "secret/test-app-malcode-java-dev"
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Validate Pull Request`, Action: `hashicorpterraform-github-actions2`, Working Directory: `.`, Workspace: `dev`*
